import type { AlphabetDescription, AlphabetTransform } from "./types";

export const DEFAULT_TEXTS: Record<AlphabetTransform, string> = {
  "ru-ka": `В тридевятом царстве, в тридесятом государстве жил-был я.
Я жил с Папой и Мамой. Мои Папа и Мама очень сильно любили друг друга. Так сильно и страстно, что часто ссорились. И это неудивительно: при такой любви люди невольно стремятся к полному единомыслию и тяжело переживают всякое разногласие. Во всяком случае, Мама тяжело это переживала. А разногласий у них было много. Например, когда я родился, Папа назвал меня Вячеслав, а Мама назвала меня Владислав. Но Папа любил Маму сильнее, и в конце концов, как правило, уступал ей. Потому восторжествовала в конце концов Мамина редакция. А звали меня просто: Славик.
Я хочу рассказать здесь поучительную историю, как меня сделали волшебником. Волшебство у меня не от хорошей жизни — как говорится, с волками жить, по волчьи выть. Вообще-то я человек православный, и колдовать мне неприлично, но ребята моего двора стали откровенно побаиваться меня после того, как одна девочка сошла от меня с ума. Обычно, когда говорят, что кто-то от кого-то "без ума", подразумевается любовь. Сразу предупреждаю: никакой любви у нас не было и в помине.
В чем-то я виноват, конечно. Я понимаю, что от слухов так просто не отмажешься. Многим неохота разбираться в жизни всерьез, их вполне устраивают схемы. Я напишу все как было — кто хочет, тот поймет. Но сразу предупреждаю: история довольно страшненькая и весьма запутанная. Слабонервных и сильно занятых прошу не беспокоиться.
Мои университеты
Игра
Игра подходила к концу и по логике вещей должна была завершиться победой моего величества. За эти немногие дни, проведенные мною в новой компании, я уже покрыл свою голову немеркнущей славой непревзойденного "Короля". Единственное, что несколько омрачало мои перспективы, это таинственная Настя.
Настя вообще была персоной, мягко говоря, необычной. Я в тот момент ее еще ни разу не видел — Настя, говорят, была в отъезде. Но вот, вчера вечером она, наконец, приехала, уже расспрашивала Вику про меня и заявила, что сегодня играет. Ребята говорили про Настю как про невесть какую важную птицу.
— Она всегда выигрывает, — сказала Вика. — С ней играть бесполезно.
— Что, очень хорошо играет? — удивился я.
— Не то слово. Я тебе говорю, с ней играть бесполезно.
— Это точно, — сказал Саня Троицын. — Она просто чует, где кто. Все равно не спрячешься.
Раз так, рассудил я, значит, лучше не распускать бойцов. А то перещелкает всех поодиночке.
Задача бойца простая — надо увидеть соперника первым. Увидеть его раньше, чем он тебя увидит. Увидеть — в смысле просто заметить, обнаружить. Я тут пока что не толкую о мистическом ВИДЕНИИ, о скрытой личности и прочее. В игре все просто. Задача — увидеть противника раньше, чем он тебя увидит, вот и все. У взрослого тут нет никаких преимуществ перед малышом. Малышу даже легче спрятаться.
Начинается игра в "Короля" с глобальных пряток — прячутся все от всех. Если тебя заметят раньше, чем заметишь ты, то роли Короля тебе уже не увидать как своих ушей. Попасться на глаза значило лишиться шансов.
Этим утром я свой шанс не упустил. Начал я так.
Выйдя из квартиры, крался по подъезду. Остановившись на втором этаже, долго прислушивался, не прячется ли кто-нибудь внизу, не спускается ли Вика сверху. Было совсем тихо. Выждав минут пять, решился идти вниз.
Никакой опасности я в тот момент не осознавал. Происходила невинная детская игра. Но у меня уже серьезно сосало под ложечкой. Всякая игра хороша именно тем, что в какой-то момент приходит вдохновение. Ты перестаешь играть и начинаешь жить игрой. За последний год я играл так мало, что теперь у меня был явный избыток нерастраченного вдохновения.
Между прочим, я очень рано понял, что взрослая жизнь — это та же игра. Почему люди так страстно гонятся за теми целями, которые они перед собой ставят? Ведь вначале они сами, по своему желанию, ставят перед собой эти цели. Казалось бы, все лишь условность! Чему огорчаться и о чем радоваться? Но когда приходит вдохновение, забываешь о том, что игра — это только игра.
Подойдя к выходу, я вдруг ощутил страх. Я не мог открыть дверь, так как за дверью меня ждала опасность. Говорят, взрослые иногда ощущают смертельную опасность кожей. Но опасность должна быть именно смертельной, иначе слабый голос "шестого чувства" не пробьется сквозь толстую кожу взрослого. У ребенка кожа тоньше. Она даже слишком тонкая. Мы, дети, часто пугаемся на пустом месте, когда бояться нечего.
Я вернулся на пол-этажа вверх и начал осторожно обозревать окрестности через окно подъезда. Все предыдущие дни интуиция у меня действовала исправно, и страх возникал только тогда, когда было действительно опасно. Честно говоря, я и сам этому удивлялся! Как будто за последний год, проведенный в монастыре, у меня появились какие-то сверхъестественные способности. Шестое чувство.
Недаром местные ребята уже держали меня за мастера. Я почти всегда становился Королем. И на сей раз внутренний голос меня не обманул — через минуту в кроне дерева в отдалении от козырька подъезда я обнаружил хорошо замаскированную засаду. В удобной расщелине между двух стволиков клена сидел Саня Троицын. Повозившись с задвижкой, я бесшумно приоткрыл форточку и вполголоса крикнул:
— Ха!
Это означало выстрел. Задача бойца проста — увидеть противника и крикнуть "ха". Кто крикнул первым, тот "убил" противника. Даже интереснее: не просто убил, а сделал его своим воином. А сам из простых вольных стрелков одним махом стал Королем.
Саня напряженно завертел головой, пытаясь увидеть того, кто его подстрелил. Но меня сквозь разделяющую нас листву, да еще в темноте подъезда, он видеть не мог.
— Сиди на месте, — сказал я сквозь форточку.
Саня наконец увидел меня.
— Пока сиди на месте, — повторил я, сложив руки рупором. — Хорошо сидишь. Я спущусь вниз и буду притворяться простым снайпером. А ты слушай и смотри.
Саня заулыбался и кивнул. Королем ему уже не стать. Боец может только переходить из-под власти одного Короля во власть другого. Но игра от этого не становится неинтересной. Наоборот, с появлением "Королей" и начинается по-настоящему интересная игра. Начинается интрига и коварство.
Подстреленный снайпер из разряда вольных стрелков переходил в разряд солдат Короля. Теперь я был Король, а Саня — мой стрелок. В этой игре никого не убивали, менялась только роль игрока. И это надлежало использовать, ведь кроме нас с Саней пока никто не знал, что я уже — Король. И что Саня уже — не вольный стрелок, а МОЙ воин.
Вначале — только вначале! — играют все против всех. Вначале все твои враги, и играть очень просто. Ясно, что надо делать. Но "Короля" придумал Дед. А его задумки просты только на первый взгляд.
Вообще-то любая игра — это притворство. Но это притворство без коварства! Обычно роли в играх бывают понятны и четко заданы. А в "Короле" самое трудное было — это сообразить, кто какую играет роль. Кто Король, кто снайпер, кто друг, кто враг. От этого зависело, что надлежит делать. Порой возникали прямо немыслимые головоломки, чем-то смутно напоминавшие мне жизнь на обратной стороне Луны. А я и затеял рассказ об этой жизни.
Изображая обычного стрелка, я осторожно выглянул из двери подъезда. С этой точки Саня был почти незаметен, а сам я был как ладони. Если бы я вышел этим путем, быть бы мне Саниным солдатом. Но медлить было нельзя — я услышал, как лифт, идущий сверху, остановился на втором этаже, и чьи-то осторожные легкие ноги двинулись к выходу. Все было ясно. Я по-взрослому решительно отворил дверь и твердой поступью вышел наружу. Дверь за мной захлопнулась, я показал Сане знаком — приготовься стрелять. А сам стал притворно красться вдоль стены, повернувшись беззащитной спиной к выходу из подъезда.
Осторожно приоткрыв дверь, Вика увидела крадущегося меня и немедленно крикнула:
— Ха!
Вика поверила, будто я — простой боец, и подстрелила меня первой. Но для меня это ее "ха" было совершенно неопасным: дело в том, что Короля нельзя просто взять и подстрелить. Король неуязвим для "выстрелов". И сам Король тоже никого подстрелить не может: Короли не воюют, а только распоряжаются. Короля защищают его воины. Чтобы Короля "убить", врагу необходимо задеть его рукой. Но рукой задеть меня Вика никак уже не могла, потому что ее тут же подбил Саня:
— Вика, ха!
Теперь Вика стала вассалом Сани. Стать Королем Саня уже не мог, но он вполне мог сделать в моем королевстве неплохую карьеру. Главное для него — не попасться на глаза чужому. Первый после Короля — это не Король, конечно, но почти Король!
Мое маленькое королевство состояло из людей, которые сумели увидеть друг друга. Кто кого увидел первым — этим и определялась иерархия. Нас окружало неизвестное, неведомое. Невидимые нам вольные стрелки и бойцы чужих армий. Моя задача была — собрать всех местных под скипетром моей державы.
Мои дела пошли в гору. Теперь у меня было уже два бойца. Всего в "снайперах" участвовало сегодня семь человек. Все, кроме меня, нецерковные. Это я деликатно выяснил при первом же знакомстве. Даже постов в среду и пятницу никто не соблюдал. Да, отцу Феодору бы не понравился такой круг моего общения.
Но теперь духовная жизнь была для меня неактуальна. Ну, не совсем неактуальна... Теперь передо мной стояла нелегкая задача — увидеть и "хакнуть" остальных пятерых. И для решения этой задачи мой непризнанный гений был совсем не лишним! Сам я, будучи Королем, "хакнуть" никого не могу. Зато Король может более или менее безопасно разгуливать по двору, попросту высматривая чужих бойцов и сообщая об их дислокации своим стрелкам. Задеть Короля незаметно для прикрывающих его бойцов почти невозможно, так что эта стратегия неплохая. Но гораздо эффективнее ввести противника в заблуждение.
Потому я решил поступить хитрее. Если начать свободно разгуливать по двору, то и дураку станет ясно, что ты — Король. Я же решил и далее притворяться простым снайпером. Теперь-то я понимаю, что это была тема дня: Король, притворяющийся рядовым бойцом. И наоборот.
— Вичка, давай так. Ты свободно гуляешь по двору, как королева. А я тихонько крадусь, как твой боец. Если кто-нибудь выскочит на тебя, хакнешь его. А если тебя хакнут, стой на месте. Только не отходи от Сани — он тебя прикроет.
— Так ты Король? — сообразила Вика. И сама как королева устроилась на самом видном месте, на малышовых каруселях, рядом с которыми в песочнице играла девочка под присмотром молодой мамы, учившейся вязать носочки. Краем глаза мамаша доброжелательно следила за развивающейся интригой.
Нападение на Вику не заставило себя ждать. Через несколько минут из-за угла выскочил маленький Андрейка и сходу заорал "Ха!". Не поверил, что Вика — королева. Или просто не сообразил по молодости, что простой снайпер не может себе позволить преспокойно рассиживать на каруселях. Так или иначе, на мгновение Андрейка сделался Королем, а Вика — его солдатом. Но только на мгновение. Потому что сидящий в засаде Саня немедленно крикнул свое "ха!", обратно подстрелив Вику, и Вика тут же сделалась опять моим бойцом.
По дедушкиным правилам, "голых" королей не бывает. Если Король теряет своего единственного бойца, то и сам он тут же становится воином в армии победителя. Правда, не рядовым воином. Подбитый Король переходит в армию победителя во главе всех своих подчиненных, старая иерархия сохраняется. Бывший Король становится вассалом Короля-победителя. Опрометчивый Андрейка нарвался на прикрытие — и так из вольных снайперов, на мгновение взлетев до королевского высочества, тут же низвергся до вассала.
А Вика подскочила к Андрейке и хлопнула его по плечу. И очень мудро поступила. Зачем, спросите? А на тот случай, если Андрейка УЖЕ был Королем, который только ПРИТВОРЯЛСЯ рядовым снайпером! Вот такая головоломка.
Победителем в данном случае остался не кто иной, как я. Как и в настоящей войне, все лавры, реально завоеванные Саней и Викой, достались Королю! Теперь у меня было уже три бойца. Младшей в нашей иерархии была теперь Вика, ведь Андрейка ее заметил первым. Но Вику это ничуть не огорчало: я еще вчера понял, что тщеславие ей чуждо. Вику удобно было использовать в качестве приманки, она охотно шла на самопожертвование.
— Отлично! — сказал я. — Ты, Саня, хорошо сидишь. Оставайся тут в засаде. Вика пусть дальше изображает королеву. Вика, ты не против?.. Кого еще настреляете — пусть пока сидят вместе с Викой. А мы с Андрейкой пойдем в разведку. Давай вокруг дома.
В разведку я шел впереди моего бойца. Меня же нельзя подстрелить! Но я маскировался, крался, изображая рядового снайпера, чтобы спровоцировать противника на "ха!" и таким образом обнаружить его.
Через полчаса в моей армии прибыло еще двое солдат. Серега-старший было подстрелил Серегу-младшего и пошел в разведку без прикрытия, понадеявшись на свои ноги. Предварительно он хорошо замаскировал своего единственного бойца. Но Серега-младший поверил моей игре и попытался меня подстрелить. Я коварно изобразил поражение, мы заговорили, Серега вылез навстречу мне из укрытия и попался на глаза Андрейке.
Теперь оставалась одна только Настя. Я собрал всех своих бойцов в одном месте, притом на видном месте. Все равно Настя не успеет шесть раз крикнуть "ха!" — кто-нибудь прикроет, решил я. Стали ждать. Игра пошла на измор. Стало скучновато. Наконец, я заподозрил, что Настя просто не играет. Саня позвонил Насте на мобильник, та ответила, что она играет. Ждите, мол.
— Она дожидается, когда нам надоест ждать и все разойдутся, — предположил я. — Какой смысл ей воевать одной против всех. Просто нет шансов. Завтра с утра попробует подстрелить того, кто попадется первым. А потом уже будут вдвоем.
По правилам, игра действительно могла длиться много дней. (Ребята говорили, что особенно классно играть в школе. Можно играть прямо день за днем, с продолжением.) Но мою версию отвергли.
— Ты не знаешь Настю, — сказала Вика гордо, как будто о своей сестре.
— Она специально ждет, когда все соберутся в одну команду, чтобы играть одной против всех, — заявил Андрейка. — Настя — волшебница.
— Волшебница? Как это — волшебница, — забеспокоился я. Мне, как человеку церковному, с волшебниками играть было... скажем так, непривычно.
— Настоящая волшебница, — сказал Серега-старший серьезно. — Она умеет летать, я видел.
— Я тоже видел, — сказал Серега-младший.
— Ты во сне видел, — сказала Вика.
— Может, и не во сне, — сказал Серега-старший. — У нее не разберешь, где сон, а где не сон.

Все задумались. Мы сидели на лавках у верхнего дома.`,
  "ka-ru": `რომელმან შექმნა სამყარო ძალითა მით ძლიერითა,
ზეგარდმო არსნი სულითა ყვნა ზეცით მონაბერითა,
ჩვენ, კაცთა, მოგვცა ქვეყანა, გვაქვს უთვალავი ფერითა,
მისგან არს ყოვლი ხელმწიფე სახითა მის მიერითა.

ჰე, ღმერთო ერთო, შენ შეჰქმენ სახე ყოვლისა ტანისა,
შენ დამიფარე, ძლევა მეც დათრგუნვად მე სატანისა,
მომეც მიჯნურთა სურვილი, სიკვდიდმდე გასატანისა,
ცოდვათა შესუბუქება, მუნ თანა წასატანისა.

ვის ჰშვენის, - ლომსა, - ხმარება შუბისა, ფარ-შიმშერისა,
- მეფისა მზის თამარისა, ღაწვ-ბადახშ, თმა-გიშერისა, -
მას, არა ვიცი, შევჰკადრო შესხმა ხოტბისა, შე, რისა?
მისთა მჭვრეტელთა ყანდისა მირთმა ხამს მართ, მი, შერისა.

თამარს ვაქებდეთ მეფესა სისხლისა ცრემლ-დათხეული,
ვთქვენი ქებანი ვისნი მე არ-ავად გამორჩეული.
მელნად ვიხმარე გიშრის ტბა და კალმად მე ნა რხეული,
ვინცა ისმინოს, დაესვას ლახვარი გულსა ხეული.

მიბრძანეს მათად საქებრად თქმა ლექსებისა ტკბილისა,
ქება წარბთა და წამწამთა, თმათა და ბაგე-კბილისა,
ბროლ-ბადახშისა თლილისა, მის მიჯრით მიწყობილისა.
გასტეხს ქვასაცა მაგარსა გრდემლი ტყვიისა ლბილისა.

აწ ენა მინდა გამოთქმად, გული და ხელოვანება, -
ძალი მომეც და შეწევნა შენგნით მაქვს, მივსცე გონება;
მით შევეწივნეთ ტარიელს, ტურფადცა უნდა ხსენება,
მათ სამთა გმირთა მნათობთა სჭირს ერთმანერთის მონება.

მო, დავსხდეთ, ტარიელისთვის ცრემლი გვდის შეუშრობელი;
მისებრი მართ დაბადებით ვინმცა ყოფილა შობილი!
დავჯე, რუსთველმან გავლექსე, მისთვის გულს ლახვარ-სობილი,
აქამდის ამბად ნათქვამი, აწ მარგალიტი წყობილი.

მე, რუსთველი ხელობითა, ვიქმ საქმესა ამა დარი:
ვის ჰმორჩილობს ჯარი სპათა, მისთვის ვხელობ, მისთვის მკვდარი;
დავუძლურდი, მიჯნურთათვის კვლა წამალი არსით არი,
ანუ მომცეს განკურნება, ანუ მიწა მე სამარი.

ესე ამბავი სპარსული, ქართულად ნათარგმანები,
ვით მარგალიტი ობოლი, ხელის-ხელ საგოგმანები,
ვპოვე და ლექსად გარდავთქვი, საქმე ვქმენ საჭოჭმანები,
ჩემმან ხელ-მქმნელმან დამმართოს ლაღმან და ლამაზმან ნები.

თვალთა, მისგან უნათლოთა, ენატრამცა ახლად ჩენა;
აჰა, გული გამიჯნურდა, მიჰხვდომია ველთა რბენა!
მიაჯეთ ვინ, ხორცთა დაწვა კმა არს, მისცეს სულთა ლხენა.
სამთა ფერთა საქებელთა ლამის ლექსთა უნდა ვლენა.

რაცა ვის რა ბედმან მისცეს, დასჯერდეს და მას უბნობდეს:
მუშა მიწყივ მუშაკობდეს, მეომარი გულოვნობდეს;
კვლა მიჯნურსა მიჯნურობა უყვარდეს და გამოსცნობდეს,
არცა ვისგან დაიწუნოს, არცა სხვათა უწუნობდეს.

შაირობა პირველადვე სიბრძნისაა ერთი დარგი,
საღმრთო, საღმრთოდ გასაგონი, მსმენელთათვის დიდი მარგი,
კვლა აქაცა ეამების, ვინცა ისმენს კაცი ვარგი;
გრძელი სიტყვა მოკლედ ითქმის, შაირია ამად კარგი.

ვითა ცხენსა შარა გრძელი და გამოსცდის დიდი რბევა,
მობურთალსა - მოედანი, მართლად ცემა, მარჯვედ ქნევა,
მართ აგრევე მელექსესა - ლექსთა გრძელთა თქმა და ხევა,
რა მისჭირდეს საუბარი და დაუწყოს ლექსმან ლევა.

მაშინღა ნახეთ მელექსე და მისი მოშაირობა,
რა ვეღარ მიჰხვდეს ქართულსა, დაუწყოს ლექსმან ძვირობა,
არ შეამოკლოს ქართული, არა ქმნას სიტყვა-მცირობა,
ხელ-მარჯვედ სცემდეს ჩოგანსა, იხმაროს დიდი გმირობა.

მოშაირე არა ჰქვიან, თუ სადმე თქვას ერთი, ორი;
თავი ყოლა ნუ ჰგონია მელექსეთა კარგთა სწორი;
განაღა თქვას ერთი, ორი, უმსგავსო და შორი-შორი,
მაგრა იტყვის: “ჩემი სჯობსო”, უცილობლობს ვითა ჯორი.

მეორე ლექსი ცოტაი, ნაწილი მოშაირეთა,
არ ძალ-უც სრულ-ქმნა სიტყვათა, გულისა გასაგმირეთა, -
ვამსგავსე მშვილდი ბედითი ყმაწვილთა მონადირეთა:
დიდსა ვერ მოჰკლვენ, ხელად აქვს ხოცა ნადირთა მცირეთა.

მესამე ლექსი კარგია სანადიმოდ, სამღერელად,
სააშიკოდ, სალაღობოდ, ამხანაგთა სათრეველად;
ჩვენ მათიცა გვეამების, რაცა ოდენ თქვან ნათელად.
მოშაირე არა ჰქვიან, ვერას იტყვის ვინცა გრძელად.

ხამს, მელექსე ნაჭირვებსა მისსა ცუდად არ აბრკმობდეს,
ერთი უჩნდეს სამიჯნურო, ერთსა ვისმე აშიკობდეს,
ყოვლსა მისთვის ხელოვნობდეს, მას აქებდეს, მას ამკობდეს,
მისგან კიდე ნურა უნდა, მისთვის ენა მუსიკობდეს.

ჩემი აწ ცანით ყოველმან, მას ვაქებ, ვინცა მიქია;
ესე მიჩნს დიდად სახელად, არ თავი გამიქიქია!
იგია ჩემი სიცოცხლე, უწყალო ვითა ჯიქია;
მისი სახელი შეფარვით ქვემორე მითქვამს, მიქია.

ვთქვა მიჯნურობა პირველი და ტომი გვართა ზენათა,
ძნელად სათქმელი, საჭირო გამოსაგები ენათა;
იგია საქმე საზეო, მომცემი აღმაფრენათა;
ვინცა ეცდების, თმობამცა ჰქონდა მრავალთა წყენათა.

მას ერთსა მიჯნურობასა ჭკვიანნი ვერ მიჰხვდებიან,
ენა დაშვრების, მსმენლისა ყურნიცა დავალდებიან;
ვთქვენ ხელობანი ქვენანი, რომელნი ხორცთა ჰხვდებიან;
მართ მასვე ჰბაძვენ, თუ ოდეს არ სიძვენ, შორით ბნდებიან.

მიჯნური შმაგსა გვიქვიან არაბულითა ენითა,
მით რომე შმაგობს მისისა ვერ-მიხვდომისა წყენითა;
ზოგთა აქვს საღმრთო სიახლე, დაშვრების აღმაფრენითა,
კვლა ზოგთა ქვე უც ბუნება კეკლუცთა ზედან ფრფენითა.

მიჯნურსა თვალად სიტურფე ჰმართებს, მართ ვითა მზეობა,
სიბრძნე, სიმდიდრე, სიუხვე, სიყმე და მოცალეობა,
ენა, გონება, დათმობა, მძლეთა მებრძოლთა მძლეობა.
ვისცა ეს სრულად არა სჭირს, აკლია მიჯნურთ ზნეობა.

მიჯნურობა არის ტურფა, საცოდნელად ძნელი გვარი;
მიჯნურობა სხვა რამეა, არ სიძვისა დასადარი:
იგი სხვაა, სიძვა სხვაა, შუა უზის დიდი მზღვარი,
ნუვინ გაჰრევთ ერთმანერთსა! გესმას ჩემი ნაუბარი!

ხამს მიჯნური ხანიერი, არ მეძავი, ბილწი, მრუში,
რა მოჰშორდეს მოყვარესა, გაამრავლოს სულთქმა, უში,
გული ერთსა დააჯეროს, კუშტი მიჰხვდეს, თუნდა ქუში;
მძულს უგულო სიყვარული, ხვევნა, კოცნა, მტლაშა-მტლუში.

ამა საქმესა მიჯნური ნუ უხმობს მიჯნურობასა:
დღეს ერთი უნდეს, ხვალე სხვა, სთმობდეს გაყრისა თმობასა;
ესე მღერასა ბედითსა ჰგავს ვაჟთა, ყმაწვილობასა.
კარგი მიჯნური იგია, ვინ იქმს სოფლისა თმობასა.

არს პირველი მიჯნურობა არ-დაჩენა ჭირთა, მალვა,
თავის-წინა იგონებდეს, ნიადაგმცა ჰქონდა ხალვა,
შორით ბნედა, შორით კვდომა, შორით დაგვა, შორით ალვა,
დათმოს წყრომა მოყვრისაგან, მისი ჰქონდეს შიში, კრძალვა.

ხამს, თავისსა ხვაშიადსა არვისთანა ამჟღავნებდეს,
არ ბედითად “ჰაის” ზმიდეს, მოყვარესა აყივნებდეს,
არსით უჩნდეს მიჯნურობა, არასადა იფერებდეს,
მისთვის ჭირი ლხინად უჩნდეს, მისთვის ცეცხლსა მოიდებდეს.

მას უშმაგო ვით მიენდოს, ვინ მოყვარე გაამჟღავნოს?
ამის მეტი რამცა ირგო: მას ავნოს და თვითცა ივნოს.
რათამცაღა ასახელა, რა სიტყვითა მოაყივნოს?
რა ჰგავა, თუ მოყვარესა კაცმან გული არ ატკივნოს!

მიკვირს, კაცი რად იფერებს საყვარლისა სიყვარულსა:
ვინცა უყვარს, რად აყივნებს მისთვის მკვდარსა, მისთვის წყლულსა?!
თუ არ უყვარს, რად არა სძულს? რად აყივნებს, რაცა სძულსა?!
ავსა კაცსა ავი სიტყვა ურჩევნია სულსა, გულსა.

თუ მოყვარე მოყვრისათვის ტირს, ტირილსა ემართლების;
სიარული, მარტოობა ჰშვენის, გაჭრად დაეთვლების;
იგონებდეს, მისგან კიდე ნურაოდეს მოეცლების,
არ დააჩნდეს მიჯნურობა, სჯობს, თუ კაცსა ეახლების.

იყო არაბეთს როსტევან, მეფე ღმრთისაგან სვიანი,
მაღალი, უხვი, მდაბალი, ლაშქარ-მრავალი, ყმიანი.
მოსამართლე და მოწყალე, მორჭმული, განგებიანი,
თვით მეომარი უებრო, კვლა მოუბარი წყლიანი.

სხვა ძე არ ესვა მეფესა, მართ ოდენ მარტო ასული,
სოფლისა მნათი მნათობი, მზისაცა დასთა დასული;
მან მისთა მჭვრეტთა წაუღის გული, გონება და სული,
ბრძენი ხამს მისად მაქებრად და ენა ბევრად ასული.

მისი სახელი - თინათინ, არს ესე საცოდნარია!
რა გაიზარდა, გაივსო, მზე მისგან საწუნარია.
მეფემან იხმნა ვაზირნი, თვით ზის ლაღი და წყნარია,
გვერდსა დაისხნა, დაუწყო მათ ამო საუბნარია.

უბრძანა: “გკითხავ საქმესა, ერთგან სასაუბნაროსა:
რა ვარდმან მისი ყვავილი გაახმოს, დაამჭნაროსა,
იგი წავა და სხვა მოვა ტურფასა საბაღნაროსა;
მზე ჩაგვისვენდა, ბნელსა ვსჭვრეტთ ღამესა უმთენაროსა.

“მე გარდასრულვარ, სიბერე მჭირს, ჭირთა უფრო ძნელია,
დღეს არა, ხვალე მოვკვდები, სოფელი ასრე მქმნელია;
რაღაა იგი სინათლე, რასაცა ახლავს ბნელია?!
ჩემი ძე დავსვათ ხელმწიფედ, ვისგან მზე საწუნელია”.

ვაზირთა ჰკადრეს: “მეფეო, რად ჰბრძანეთ თქვენი ბერობა?
ვარდი თუ გახმეს, ეგრეცა გვმართებს მისივე ჯერობა:
მისივე ჰმეტობს ყოველსა სული ტურფა ფერობა.
მთვარესა მცხრალსა ვარსკვლავმან ვითამცა ჰკადრა მტერობა?!

“მაგას ნუ ჰბრაძანებთ, მეფეო, ჯერთ ვარდი არ დაგჭნობია,
თქვენი თათბირი ავიცა სხვისა კარგისა მჯობია;
ხამს განაღამცა საქმნელად, რაცა თქვენ გულსა გლმობია:
სჯობს და მას მიეც მეფობა, ვისგან მზე შენაფლობია.

“თუცა ქალია, ხელმწიფედ მართ ღმრთისა დანაბადია;
არ გათნევთ, იცის მეფობა, უთქვენოდ გვითქვამს კვლა დია;
შუქთა მისთაებრ საქმეცა მისი მზებრ განაცხადია.
ლეკვი ლომისა სწორია, ძუ იყოს, თუნდა ხვადია”.

ავთანდილ იყო სპასპეტი, ძე ამირ-სპასალარისა,
საროსა მჯობი ნაზარდი, მსგავსი მზისა და მთვარისა,
ჯერთ უწვერული, სადარო ბროლ-მინა საცნობარისა;
მას თინათინის შვენება ჰკლევდის წამწამთა ჯარისა.

გულსა მისსა მიჯნურობა მისი ჰქონდა დამალულად;
რა მოჰშორდის, ვერ-მჭვრეტელმან ვარდი შექმნის ფერ-ნაკლულად;
ნახის, ცეცხლი გაუახლდის, წყლული გახდის უფრო წყლულად.
საბრალოა, სიყვარული კაცსა შეიქმს გულ-მოკლულად!

რა მეფედ დასმა მეფემან ბრძანა მისისა ქალისა,
ავთანდილს მიჰხვდა სიამე, ვსება სჭირს მას აქ ალისა;
თქვა: “ზედა-ზედა მომხვდების ნახვა მის ბროლ-ფიქალისა,
ნუთუ მით ვპოვო წამალი მე ჩემი, ფერ-გამქრქალისა!»

არაბეთს გასცა ბრძანება დიდმან არაბთა მფლობელმან:
“თინათინ ჩემი ხელმწიფედ დავსვი მე, მისმან მშობელმან;
მან განანათლნეს ყოველნი, ვით მზემან მანათობელმან.
მოდით და ნახეთ ყოველმან შემსხმელმან, შემამკობელმან!»

მოვიდეს სრულნი არაბნი, ჯარი განმრავლდა ხასისა:
ავთანდილ პირ-მზე, სპასპეტი ლაშქრისა ბევრ-ათასისა,
ვაზირი სოგრატ, მოახლე მეფისა დასთა დასისა;
მათ რომე დადგეს საჯდომი, თქვეს: “უთქმელია ფასისა!»

თინათინ მიჰყავს მამასა პირითა მით ნათელითა,
დასვა და თავსა გვირგვინი დასდგა თავისა ხელითა,
მისცა სკიპტრა და შემოსა მეფეთა სამოსელითა.
ქალი მზებრ უჭვრეტს ყოველთა ცნობითა ზე-მხედველითა.

უკუდგეს და თაყვანის-სცეს მეფემან და მისთა სპათა,
დალოცეს და მეფედ დასვეს, ქება უთხრეს სხვაგნით სხვათა,
ბუკსა ჰკრეს და წინწილანი დაატკბობდეს მათთა ხმათა.
ქალი ტირს და ცრემლსა აფრქვევს, ჰხრის ყორნისა ბოლო-ფრთათა.

მამისა ტახტსა საჯდომად თავი არ ეღირსებოდა,
ამად ტირს, ბაღი ვარდისა ცრემლითა აივსებოდა;
მეფე სწვრთის: “მამა ყოველი ძისაგან ითავსებოდა,
ამისად ქმნამდის დამწველი ცეცხლი არ დამევსებოდა”.

უბრძანა: “ნუ სტირ, ასულო, ისმინე ჩემი თხრობილი:
დღეს შენ ხარ მეფე არაბეთს, ჩემგან ხელმწიფედ ხმობილი,
აქათგან ესე სამეფო შენი არს მართ მონდობილი.
ხარმცა ბრძნად მქმნელი საქმისა, იყავ წყნარი და ცნობილი!

“ვარდთა და ნეხვთა ვინათგან მზე სწორად მოეფინების,
დიდთა და წვრილთა წყალობა შენმცა ნუ მოგეწყინების!
უხვი ახსნილსა დააბამს, იგი თვით ების, ვინ ების.
უხვად გასცემდი, ზღვათაცა შესდის და გაედინების.

“მეფეთა შიგან სიუხვე, ვით ედემს ალვა, რგულია;
უხვსა ჰმორჩილობს ყოველი, იგიცა, ვინ ორგულია;
სმა-ჭამა - დიდად შესარგი, დება რა სავარგულია?!
რასაცა გასცემ, შენია; რას არა, დაკარგულია!»

ამა მამისა სწავლასა ქალი ბრძნად მოისმინებდა,
ყურსა უპყრობდა, ისმენდა, წვრთასა არ მოიწყინებდა;
მეფე სმასა და მღერასა იქმს, მეტად მოილხინებდა;
თინათინ მზესა სწუნობდა, მაგრა მზე თინათინებდა.

მოიხმო მისი გამზრდელი, ერთგული, ნაერთგულევი,
უბრძანა: “ჩემი საჭურჭლე, შენგან დანაბეჭდულევი,
მომართვი ჩემი ყველაი, ჩემი ნაუფლისწულევი”.
მოართვეს. გასცა უზომო, უანგარიშო, ულევი.

მას დღე გასცემს ყველაკასა სივაჟისა მოგებულსა,
რომე სრულად ამოაგებს მცირესა და დიდებულსა.
მერმე ბრძანა: “ვიქმ საქმესა, მამისაგან სწავლებულსა,
ჩემსა ნუვინ ნუ დაჰმალავს საჭურჭლესა დადებულსა”.

უბრძანა: “წადით, გახსენით, რაცა სად საჭურჭლენია!
ამილახორო, მოასხი რემა, ჯოგი და ცხენია!»
მოიღეს, გასცა უზომო, სიუხვე არ მოსწყენია.
ლარსა ჰხვეტდიან ლაშქარნი, მართ ვითა მეკობრენია.

ალაფობდეს საჭურჭლესა მისსა, ვითა ნათურქალსა,
მას ტაიჭსა არაბულსა, ქვე-ნაბამსა, ნასუქალსა;
რომე ჰგვანდა სიუხვითა ბუქსა, ზეცით ნაბუქალსა,
არ დაარჩენს ცალიერსა არ ყმასა და არცა ქალსა.

დღე ერთ გარდახდა; პურობა, სმა-ჭამა იყო, ხილობა,
ნადიმად მსხდომთა ლაშქართა მუნ დიდი შემოყრილობა;
მეფემან თავი დაჰკიდა და ჰქონდა დაღრეჯილობა.
“ნეტარ, რა უმძიმს, რა სჭირსო?”, შექმნეს ამისი ცილობა.

თავსა ზის პირ-მზე ავთანდილ, მჭვრეტთაგან მოსანდომია,
სპათა სპასპეტი, ჩაუქი, ვითა ვეფხი და ლომია;
ვაზირი ბერი სოგრატი თვით მასთანავე მჯდომია.
თქვეს, თუ: “რა უმძიმს მეფესა, ანუ რად ფერი ჰკრთომია?»

თქვეს, თუ: “მეფე ცუდსა რასმე გონებასა ჩავარდნილა,
თვარა აქა სამძიმარი მათი ყოლა არა ქმნილა”.
ავთანდილ თქვა: “სოგრატ, ვჰკითხოთ, გვითხრას, რადმცა შეგვეცილა?
ვჰკადროთ რამე სალაღობო, რასათვისმცა გაგვაწბილა?»

ადგეს სოგრატ და ავთანდილ ტანითა მით კენარითა,
თვითო აივსეს ჭიქები, მივლენ ქცევითა წყნარითა,
წინა მიუსხდეს მუხლ-მოყრით, პირითა მოცინარითა.
ვაზირი ლაღობს ენითა, წყლიანად მოუბნარითა:

“დაგიღრეჯია, მეფეო, აღარ გიცინის პირიო.
მართალ ხარ: წახდა საჭურჭლე თქვენი მძიმე და ძვირიო,
ყველასა გასცემს ასული თქვენი საბოძვარ-ხშირიო;
ყოლამცა მეფედ ნუ დასვი! თავსა რად უგდე ჭირიო?»

რა მეფემან მოისმინა, გაცინებით შემოჰხედნა,
გაუკვირდა: ვით მკადრაო, ან სიტყვანი ვით გაბედნა?!
“კარგა ჰქმენო, - დაუმადლა, წყალობანი უიმედნა, -
ჩემი ზრახვა სიძუნწისა, ტყუის, ვინცა დაიყბედნა!

“ეგე არ მიმძიმს, ვაზირო, ესეა, რომე მწყენია:
სიბერე მახლავს, დავლიენ სიყმაწვილისა დღენია,
კაცი არ არის, სითგანცა საბრძანებელი ჩვენია,
რომე მას ჩემგან ესწავლნეს სამამაცონი ზნენია.

“ერთაი მიზის ასული, ნაზარდი სათუთობითა;
ღმერთმან არ მომცა ყმა-შვილი, - ვარ საწუთროსა თმობითა, -
ანუმცა მგვანდა მშვილდოსნად, ანუ კვლა ბურთაობითა;
ცოტასა შემწევს ავთანდილ ჩემგანვე ნაზარდობითა”.

ყმა მეფისა ბრძანებასა ლაღი წყნარად მოისმენდა,
თავ-მოდრეკით გაიღიმნა, გაცინება დაუშვენდა,
თეთრთა კბილთათ გამომაკრთალსა შუქსა ველთა მოაფენდა.
მეფე ჰკითხავს: “რას იცინი, ანუ ჩემგან რას შეგრცხვენდა?»

კვლა უბრძანა: “თავსა ჩემსა, რას იცინი, რად დამგმეო?»
ყმამან ჰკადრა: ”მოგახსენებ და ფარმანი მიბოძეო,
რაცა გკადრო, არ გეწყინოს, არ გაჰრისხდე, არ გასწყრეო,
არ გამხადო კადნიერად, არ ამიკლო ამათზეო”.

უბრძანა: “რადმცა ვიწყინე თქმა შენგან საწყინარისა!»
ფიცა მზე თინათინისა, მის მზისა მოწუნარისა.
ავთანდილ იტყვის: “დავიწყო კადრება საუბნარისა:
ნუ მოჰკვეხ მშვილდოსნობასა, თქმა სჯობს სიტყვისა წყნარისა.

“მიწაცა თქვენი ავთანდილ თქვენს წინა მშვილდოსანია;
ნაძლევი დავდვათ, მოვასხნეთ მოწმად თქვენნივე ყმანია;
მოასპარეზედ ვინ მგავსო? - ცუდნიღა უკუთქმანია.
გარდამწყვედელი მისიცა ბურთი და მოედანია!»

- “მე არ შეგარჩენ შენ ჩემსა მაგისა დაცილებასა.
ბრძანე, ვისროლოთ, ნუ იქმო შედრეკილობა-კლებასა,
კარგთა ყმათასა ვიქმოდეთ მოწმად ჩვენთანა ხლებასა,
მერმე გამოჩნდეს მოედანს, ვისძი უთხრობდენ ქებასა!»

ავთანდილცა დაჰმორჩილდა, საუბარი გარდაწყვიდეს,
იცინოდეს, ყმაწვილობდეს, საყვარლად და კარგად ზმიდეს,
ნაძლევიცა გააჩინეს, ამა პირსა დაასკვნიდეს:
“ვინცა იყოს უარესი, თავ-შიშველი სამ დღე ვლიდეს!»

კვლა ბრძანა: “მონა თორმეტი შევსხათ ჩვენთანა მარებლად,
თორმეტი ჩვენად ისრისა მომრთმევლად, მოსახმარებლად, -
ერთაი შენი შერმადინ არს მათად დასადარებლად, -
ნასროლ-ნაკრავსა სთვალვიდენ უტყუვრად, მიუმცდარებლად”.

მონადირეთა უბრძანა: “მინდორნი მოიარენით,
დასცევით ჯოგი ნადირთა, თავნი ამისთვის არენით”.
ლაშქარნი სამზოდ აწვივნეს: “მოდით და მოიჯარენით”.
გაყარეს სმა და ნადიმი. მუნ ამოდ გავიხარენით.`,
};

export const DEFAULT_SYMBOL_LIMIT = 300;
export const MIN_SYMBOL_LIMIT = 15;
export const MAX_SYMBOL_LIMIT = 10000;

export const DEFAULT_ALPHABETS: Record<AlphabetTransform, AlphabetDescription> =
  {
    "ru-ka": {
      transform: "ru-ka",
      nameKey: "alphabet.names.ru-ka",
      isCustom: false,
      groups: [
        {
          from: ["а"],
          to: ["ა"],
        },
        {
          from: ["о"],
          to: ["ო"],
        },
        {
          from: ["е", "э"],
          to: ["ე"],
        },
        {
          from: ["н"],
          to: ["ნ"],
        },
        {
          from: ["и", "ы", "й"],
          to: ["ი"],
        },
        {
          from: ["т"],
          to: ["ტ", "თ"],
        },
        {
          from: ["р"],
          to: ["რ", "ღ"],
        },
        {
          from: ["с"],
          to: ["ს"],
        },
        {
          from: ["л"],
          to: ["ლ"],
        },
        {
          from: ["в"],
          to: ["ვ"],
        },
        {
          from: ["к"],
          to: ["კ", "ქ"],
        },
        {
          from: ["м"],
          to: ["მ"],
        },
        {
          from: ["п"],
          to: ["პ"],
        },
        {
          from: ["у"],
          to: ["უ"],
        },
        {
          from: ["д"],
          to: ["დ"],
        },
        {
          from: ["б"],
          to: ["ბ"],
        },
        {
          from: ["г"],
          to: ["გ"],
        },
        {
          from: ["дз"],
          to: ["ძ"],
        },
        {
          from: ["дж"],
          to: ["ჯ"],
        },
        {
          from: ["з"],
          to: ["ზ"],
        },
        {
          from: ["ц"],
          to: ["ჱ"],
        },
        {
          from: ["ж"],
          to: ["ჟ"],
        },
        {
          from: ["ф"],
          to: ["ფ"],
        },
        {
          from: ["ш"],
          to: ["შ"],
        },
        {
          from: ["ч"],
          to: ["ჩ", "ჭ"],
        },
        {
          from: ["ц"],
          to: ["ც", "წ"],
        },
        {
          from: ["х"],
          to: ["ხ", "ჰ"],
        },
        {
          from: ["я"],
          to: ["ია"],
        },
        {
          from: ["ю"],
          to: ["იუ"],
        },
      ],
    },
    "ka-ru": {
      transform: "ka-ru",
      nameKey: "alphabet.names.ka-ru",
      isCustom: false,
      groups: [
        {
          from: ["ა"],
          to: ["а"],
        },
        {
          from: ["ბ"],
          to: ["б"],
        },
        {
          from: ["გ"],
          to: ["г"],
        },
        {
          from: ["დ"],
          to: ["д"],
        },
        {
          from: ["ე"],
          to: ["э"],
        },
        {
          from: ["ვ"],
          to: ["в"],
        },
        {
          from: ["ზ"],
          to: ["з"],
        },
        {
          from: ["თ"],
          to: ["т'"],
        },
        {
          from: ["ი"],
          to: ["и"],
        },
        {
          from: ["კ"],
          to: ["к"],
        },
        {
          from: ["ლ"],
          to: ["л"],
        },
        {
          from: ["მ"],
          to: ["м"],
        },
        {
          from: ["ნ"],
          to: ["н"],
        },
        {
          from: ["ო"],
          to: ["о"],
        },
        {
          from: ["პ"],
          to: ["п"],
        },
        {
          from: ["ჟ"],
          to: ["ж"],
        },
        {
          from: ["რ"],
          to: ["р"],
        },
        {
          from: ["ს"],
          to: ["с"],
        },
        {
          from: ["ტ"],
          to: ["т"],
        },
        {
          from: ["უ"],
          to: ["у"],
        },
        {
          from: ["ფ"],
          to: ["ф"],
        },
        {
          from: ["ქ"],
          to: ["к'"],
        },
        {
          from: ["ღ"],
          to: ["гх"],
        },
        {
          from: ["ყ"],
          to: ["к'"],
        },
        {
          from: ["შ"],
          to: ["ш"],
        },
        {
          from: ["ჩ"],
          to: ["ч"],
        },
        {
          from: ["ც"],
          to: ["ц"],
        },
        {
          from: ["ძ"],
          to: ["дз"],
        },
        {
          from: ["წ"],
          to: ["ц'"],
        },
        {
          from: ["ჭ"],
          to: ["ч'"],
        },
        {
          from: ["ხ"],
          to: ["х"],
        },
        {
          from: ["ჯ"],
          to: ["дж"],
        },
        {
          from: ["ჰ"],
          to: ["х'"],
        },
      ],
    },
  };
